# 데이터프레임 인덱스 조작

In [ ]:
https://datascienceschool.net/01%20python/04.05%20%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84%20%EC%9D%B8%EB%8D%B1%EC%8A%A4%20%EC%A1%B0%EC%9E%91.html

## 인덱스 설정 및 제거

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.vstack([list('ABCDE'), np.round(np.random.rand(3, 5), 2)])

array([['A', 'B', 'C', 'D', 'E'],
       ['0.64', '0.79', '0.58', '0.27', '0.5'],
       ['0.19', '0.72', '0.46', '0.33', '0.94'],
       ['0.41', '0.63', '0.44', '0.25', '0.72']], dtype='<U32')

In [3]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [4]:
df2 = df1.set_index('C1')
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [5]:
df2.reset_index(inplace=True)
df2

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

### 연습문제 4.5.1

In [6]:
np.random.seed(2021)
data = np.random.randint(40, 100, size=(5,3))
df_score1 = pd.DataFrame(data, columns=['국어', '영어', '수학'])
df_score1

   국어  영어  수학
0  92  61  97
1  40  85  70
2  62  84  67
3  69  61  69
4  64  52  94

In [7]:
df_score1.index = ['Ailee', 'Elizabeth', 'James', 'Maria', 'Brian']
df_score1.index.name = '이름'
df_score1

           국어  영어  수학
이름
Ailee      92  61  97
Elizabeth  40  85  70
James      62  84  67
Maria      69  61  69
Brian      64  52  94

In [8]:
df_score2 = df_score1.reset_index()
df_score2

          이름  국어  영어  수학
0      Ailee  92  61  97
1  Elizabeth  40  85  70
2      James  62  84  67
3      Maria  69  61  69
4      Brian  64  52  94

In [9]:
# df_score2 = df_score2.set_index('이름')
df_score2.set_index('이름', inplace=True)
df_score2

           국어  영어  수학
이름
Ailee      92  61  97
Elizabeth  40  85  70
James      62  84  67
Maria      69  61  69
Brian      64  52  94

# 다중 인덱스

In [10]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                   index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74